# IsDone Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointIterator..::..IsDone Method
PointIterator Class See Also
---
Identifies if the iteration has reached the end of the collection.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsDone()
```

Visual Basic
---
```text
Public Function IsDone As Boolean
```

Visual C++
---
```text
public:
bool IsDone()
```

# ### Return Value
True if the iteration has reached the end, false otherwise.
# See Also
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace